[
    {
        "title":  "-Y. Han, J. Kim, J. Lee, J.-H. Nah, Y.-S. Ho, and W.-C. Park, “Efficient Haze Removal from a Single Image Using a DCP-Based Lightweight U-Net Neural Network Model,” Sensors, 24(12), Jun. 2024.",
        "category": "International_Journal"
    },
    {
        "title": "-E. Kim, S. Choi, C. G. Kim, and W.-C. Park, “Multi-Threaded Sound Propagation Algorithm to Improve Performance on Mobile Devices,” Sensors, 23 (2), Jan. 2023.",
        "category": "International_Journal"
    }, 
    {
        "title": "-J. Lee, C.-G. Kim, Y.-K. Moon, and W.-C. Park, “An Implementation of Inverse Cosine Hardware for Sound Rendering Applications,” Sensors, 23(15), 6731, Jul. 2023.",
        "category": "International_Journal"
    },
    {
        "title":  "-Eunjae Kim, Sukwon Choi, Jiyoung Kim, Jae-ho Nah, Woonam Jung, Tae-hyeong Lee, Yeon-kug Moon, Woo-chan Park, “An Architecture and Implementation of Real-Time Sound Propagation Hardware for Mobile Devices”, SIGGRAPH Asia 2023 Conference Papers. ACM, Dec. 2023",
        "category": "International_Conferences"
    },
    {
        "title": "-Eunjae Kim,  Juwon Yun, Woo-Nam Chung, Jae-Ho Nah,  Youngsik Kim, Cheong Ghil Kim, Woo-Chan Park, “Effective Algorithm to Control Depth Level for Performance Improvement of Sound Tracing”,  Journal of Web Engineering, Vol. 21, no. 3,  pp. 713-728.  Feb. 2022.",
        "category": "International_Journal"
    },
    {
        "title": "-Imjae Hwang,  Juwon Yun, Woo-Nam Chung, Jaeshin Lee,  Cheong Ghil Kim, Youngsik Kim, Woo-Chan Park, “Lossless Compression Algorithm and Architecture for Reduced Memory Bandwidth Requirement with Improved Prediction Based on the Multiple DPCM Golomb-Rice Algorithm”,  Journal of Web Engineering, Vol. 20, no. 6, pp. 1813-1828. Oct. 2021.",
        "category": "International_Journal"
    },
    {
        "title": "-Jaeshin Lee, Imjae Hwang, Youngsik Kim, Cheong Ghil Kim, Woo-Chan Park, “An Effective Burst Access Scheme for Lossless Frame Buffer Compression on a Video Decoder”, IEEE Access.  Vol. 9, Issue. 1, pp. 124419-124424. Aug. 2021.",
        "category": "International_Journal"
    },
    {
        "title": "-Jinyoung Lee, Jae-Ho Nah, Woo-Nam Chung, Tae-Hyoung Lee, Woo-Chan Park, “An Implementation of Multi-Chip Architecture for Real-Time Ray Tracing Based on Parallel Frame Rendering”, IEEE Access.  Vol. 9, Issue. 1, pp. 118968-118976. Aug. 2021.",
        "category": "International_Journal"
    },
    {
        "title": "-Juwon Yun, Jinyoung Lee, Woo-Nam Chung, Cheong Ghil Kim, and Woo-Chan Park, “A Latency-Effective Pipelined Divider for Double-Precision Floating-Point Numbers”, IEEE Access. Vol. 8, Issue. 1, pp 165740-165747. Sep. 2020.",
        "category": "International_Journal"
    },
    {
        "title": "-Jinyoung Lee, Woonam Chung, Tae-Hyoung Lee, Jae-Ho Nah, Youngsik Kim, and Woo-Chan Park, “Load Balancing Algorithm for Real-Time Ray Tracing of Dynamic Scenes”, IEEE Access. Vol. 8, Issue. 1, pp 165003-165009. Aug. 2020.",
        "category": "International_Journal"
    },
    {
        "title": "-Jaeshin Lee, Juwon Yun, Jinyoung Lee, Imjae Hwang, Dukki Hong, Youngsik Kim, Cheong Ghil Kim, and Woo-Chan Park, “An Effective Algorithm and Architecture for the High-Throughput Lossless Compression of High-Resolution Images”, IEEE Access.  Vol. 7, Issue. 1, pp 138803-138815. Sep. 2019.",
        "category": "International_Journal"
    },
    {
        "title": "-Juwon Yun, Jinyoung Lee, Cheong Ghil Kim, Yeongkyu Lim, Jae-Ho Nah, Youngsik Kim, Woo-Chan Park, “A Practically Applicable Performance Prediction Model based on Capabilities of Texture Mapping Units for Mobile GPUs”, IEEE Access.  Vol. 7, Issue. 1, pp 102975-102984. Jul. 2019.",
        "category": "International_Journal"
    },
    {
        "title": "-Juwon Yun, Jinyoung Lee, Cheong Ghil Kim, Yeong-Kyu Lim, Jae-Ho Nah, Youngsik Kim, Woo-Chan Park, “A Novel Performance Prediction Model for Mobile GPUs”, IEEE Access. Vol. 6, Issue. 1, pp. 16235-16245, Mar. 2018.",
        "category": "International_Journal"
    },
    {
        "title": "-Dong-Seok Kim, Jae-Ho Nah, and Woo-Chan Park, “Geometry transition method to improve ray-tracing precision, Multimedia Tools and Applications”, Vol.75, No. 10, pp. 5689-5700, May 2016.",
        "category": "International_Journal"
    },
    {
        "title": "-Jae-Ho Nah, Jin-Woo Kim, Junho Park, Won-Jong Lee, Jeong-Soo Park, Seok-Yoon Jung,  Woo-Chan Park, Dinesh Manocha, and Tach-Don Han, “HART: A Hybrid Architecture for Ray Tracing Animated Scenes”, IEEE Transactions on Visualization and Computer Graphics, Vol. 21, No.3, pp. 389-401, Mar. 2015.",
        "category": "International_Journal"
    },
    {
        "title": "-Jae-Ho Nah, Hyuck-Joo Kwon, Dong-Seok Kim, Cheol-Ho Jeong, JinHong Park, Tack-Don Han, Dinesh Manocha, and Woo-Chan Park, “RayCore: A ray-tracing hardware architecture for mobile devices”,ACM Transactions on Graphics, Vol. 33, No. 5, Article 162, Aug. 2014.",
        "category": "International_Journal"
    },
    {
        "title": "H.-J. Kwon, J.-H. Nah, D. Manocha, and W.-C. Park, “Effective traversal algorithms and hardware architecture for pyramidal inverse displacement mapping,” Computers &amp; Graphics, Feb. 2014."
    },
    {
        "title": "D. Kim and S. Kwon, “Factors associated with utilization of Traditional Korean Medicine: Results from a panel analysis,” European Journal of Integrative Medicine,Elsevier BV, Sep. 2016."
    },
    {
        "title": "J. Park, W. Park, J.-H. Nah, and T. Han, “Node pre-fetching architecture for real-time ray tracing,” Information and Communications Engineers (IEICE), 2013."
    },
    {
        "title": "Y.-J. PARK, W.-C. PARK, J.-H. BAE, J. PARK, and T.-D. HAN, “Effective Fixed-Point Pipelined Divider for Mobile Rendering Processors,” Information and Communications Engineers (IEICE), 2013."
    },
    {
        "title": "J. Park, I.-S. Kim, W.-C. Park, Y.-J. Park, and T.-D. Han, “A pixel pipeline architecture with selective z-test scheme for 3D graphics processors,” Microprocessors and Microsystems, Elsevier BV, May. 2013."
    },
    {
        "title": "Y.-S. Kang, J.-H. Nah, W.-C. Park, and S.-B. Yang, “gkDtree: A group-based parallel update kd-tree for interactive ray tracing,” Journal of Systems Architecture,Elsevier BV, Mar. 2013."
    },
    {
        "title": "J.-H. Nah, Y.-H. Jung, W.-C. Park, and T.-D. Han, “Efficient ray sorting for the tracing of incoherent rays,” Information and Communications Engineers (IEICE), 2012."
    },
    {
        "title": "J.-H. Nah et al., “T&amp;I engine,” Proceedings of the 2011 SIGGRAPH Asia Conference. ACM, Dec. 2011."
    },
    {
        "title": "Hong-Sik Kim, Joohong Lee, Hyunjin Kim, Sungho Kang, and Woo Chan Park, “A Lossless Color Image Compression Architecture Using a Parallel Golomb-Rice Hardware CODEC,” Institute of Electrical and Electronics Engineers (IEEE), Nov. 2011."
    },
    {
        "title": "W.-C. Park, D.-S. Kim, J.-S. Park, S.-D. Kim, H.-S. Kim, and T.-D. Han, “The design of a texture mapping unit with effective MIP-map level selection for real-time ray tracing,” Information and Communications Engineers (IEICE), 2011."
    },
    {
        "title": "J. Park, J. Kim, W.-C. Park, Y. Kim, C. Jeong, and T.-D. Han, “An effective rasterization architecture for mobile vector graphics processors,” Information and Communications Engineers (IEICE), 2011."
    },
    {
        "title": "W.-C. Park et al., “An effective depth data memory system using an escape count buffer for 3D rendering processors,” Information and Communications Engineers (IEICE), 2011."
    },
    {
        "title": "W.-C. Park et al., “The design of compressed memory system for depth data in 3D rendering processors,” Information and Communications Engineers (IEICE), 2010."
    },
    {
        "title": "H.-S. Kim, Y. Jung, H. Kim, J.-H. Ahn, W.-C. Park, and S. Kang, “A high performance network-on-chip scheme using lossless data compression,” Information and Communications Engineers (IEICE), 2010."
    },
    {
        "title": "W.-J. LEE, V. P. SRINI, W.-C. PARK, S. MURAKI, and T.-D. HAN, “An Effective Load Balancing Scheme for 3D Texture-Based Sort-Last Parallel Volume Rendering on GPU Clusters,” Information and Communications Engineers (IEICE), Mar. 2008."
    },
    {
        "title": "W.-C. Park, C.-G. Kim, D.-K. Yoon, K.-W. Lee, I.-S. Kim, and T.-D. Han, “A consistency-free memory architecture for sort-last parallel rendering processors,” Journal of Systems Architecture,Elsevier BV, May. 2007."
    },
    {
        "title": "*Lee, S. G., Park, W. C., Lee, W. J., Yang, S. B., & Han, T. D. (2007). An effective bump mapping hardware architecture using polar coordinate system. Journal of information science and engineering, 23(2), 569-588."
    },
    {
        "title": "M.-H Choi, W.-C. Park, F. Neelamkavil, T.-D. Han, and S.-D. Kim, “An effective visibility culling method based on cache block,” Institute of Electrical and Electronics Engineers (IEEE), Aug. 2006."
    },
    {
        "title": "*Park, W. C., Yoon, D. K., Lee, K. W., Kim, I. S., Kim, K. S., Lee, W. J., ... & Yang, S. B. (2006). A processor architecture with effective memory system for sort-last parallel rendering. In Architecture of Computing Systems-ARCS 2006: 19th International Conference, Frankfurt/Main, Germany, March 13-16, 2006. Proceedings 19 (pp. 160-175). Springer Berlin Heidelberg."
    },
    {
        "title": "*Kim, B. U., Kim, K. W., Park, W. C., Yang, S. B., & Han, T. D. (2005). A simple and efficient triangle strip filtering algorithm. Journal of information science and engineering, 21(6), 1277-1288."
    }
]
